In [1]:
import pandas as pd

In [6]:
import pandas as pd
dict = {
    'Name ':['Rahul Choudhary','Rahul Duhan','Pratham Mahajan','Swati','Mukul','Nidhi','Prashant','Vivek','Om','Prince'],
    'Age': [22, 20, 19, 18, 20,20,21,19,20,20],
    'Gender':['Male','Male','Male','Female','Male','Female','Male','Male','Male','Male']
}

df1 = pd.DataFrame()
print(df1)

Empty DataFrame
Columns: []
Index: []

In [7]:
df1 = pd.DataFrame(dict)
df1

             Name   Age  Gender
0  Rahul Choudhary   22    Male
1      Rahul Duhan   20    Male
2  Pratham Mahajan   19    Male
3            Swati   18  Female
4            Mukul   20    Male
5            Nidhi   20  Female
6         Prashant   21    Male
7            Vivek   19    Male
8               Om   20    Male
9           Prince   20    Male

#### 1. Display Top 3 Rows of the Dataset

In [8]:
df1[0:3]

             Name   Age Gender
0  Rahul Choudhary   22   Male
1      Rahul Duhan   20   Male
2  Pratham Mahajan   19   Male